[
  {
    "name": "Jude Obiakor",
    "description": "Group Chief Executive Officer",
    "image": "/images/team/jude-obiakor.jpg",
    "about": "<p>Jude Obiakor, the Group Managing Director of Fasyl Technology, is a seasoned expert in business strategy, leadership, and international business development, boasting over two decades of experience. His  expertise spans business re-engineering, software implementation, and fintech consulting across diverse sectors such as banking, oil and gas, telecommunications, FMCG, and the public sector.</p> <p>With a proven track record in transforming high-value, mission-critical projects across multi-platform environments, Jude has made significant contributions to enterprise software engineering, project management, and financial software consulting. His work has greatly benefited key institutions across Africa, including Ecobank Group, Nedbank South Africa, National Commercial Bank Libya, EFCC Nigeria, and NOTAP.</p> <p>Alongside a B.Sc. in Computer Science from Yaba College of Technology and an MBA from China Europe International Business School, Jude also possesses a management certificate from Harvard University and a Radical Innovation Certificate from MIT. His deep interests lie in re-engineering strategies, enterprise horizontalization, and business externalities. </p>",
    "category": "board"
  },
  {
    "name": "Angela Jide-Jones",
    "description": "Director",
    "image": "/images/team/angela-jide.jpg",
    "about": "<p>Angela Jide-Jones is a seasoned banker and serial entrepreneur with over two decades of experience in core banking, startups, and corporate finance. As CEO of SEWA Capital Limited, she has led the growth of businesses in financial services, fintech, hospitality, and more. </p> <p>Angela began her career at the Merchant Bank of Africa, rising to General Manager, Private Banking at Access Bank. She holds a bachelor’s degree in Economics and Statistics from the University of Benin, an MBA from ESUT Business School, and a Master of Science in Finance from Cass Business School, City University, UK.</p> <p>Her excellence has earned her multiple awards, including recognitions from Zenith International Bank and the Rotary Club of Falomo. A passionate advocate for women, Angela supports rural widows in the Niger Delta through the SEWA Foundation. Widely traveled, she enjoys music and cooking.</p>",
    "category": "board"
  },
  {
    "name": "Chinyere Onuzo",
    "description": "Director",
    "image": "/images/team/placeholder.png",
    "about": "<p>Chinyere Onuzo is the Head of Corporate Services at Montego, where sheoversees human resources, administrative, and IT functions. With over 12years in HR and 17 years of work experience, Chinyere has a strongbackground in enhancing organizational operations.</p> <p>She began her career in Nigeria as a Human Resources Executive atFinance Application Systems Limited before joining Montego UpstreamServices in 2014. In her role, she develops and implements employeerelations and human resources policies, programs, and practices.Chinyere also drives IT strategies, ensuring effective management ofhuman capital, vendors, hardware, and software.</p><p>Her strategic initiatives address business challenges and contribute toachieving long-term objectives. Chinyere holds a Bachelor's and aMaster's degree in Business Management from the University of Texas atArlington.</p>",
    "category": "board"
  },
  {
    "name": "Bennedikter China Molokwu",
    "description": "Non Executive director",
    "image": "/images/team/benedickter-mokwolu.jpg",
    "about": "",
    "category": "board"
  },
  {
    "name": "Adedayo Adekunle",
    "description": "Non Executive director",
    "image": "/images/team/adedayo-adekunle.jpg",
    "about": "",
    "category": "board"
  },
  {
    "name": "Ede Naps Egbuche",
    "description": "Board Executive",
    "image": "/images/team/ede-naps.jpg",
    "about": "<p>Ede is a visionary leader with 27 years of experience in enterprise architecture and business transformation in Africa. She started her career with Nigeria’s MTS Mobile Network and Dial 'NT Ltd, pioneering prepaid mobile and international calling solutions. Ede co-founded QCG Limited in 2008, a key SAP partner, leading significant projects for major organizations like Nigeria Liquified Natural Gas and Federal Inland Revenue Services.</p><p>She has been instrumental in implementing SAP ERP systems and driving business transformation for entities such as the World Bank in Delta and Rivers States. Ede is passionate about youth empowerment, establishing the first NIIT training center in Benin City and certifying hundreds in IT skills.</p><p>Ede holds an M.Sc. in Human Capital Management from American International University, an MBA from the University of Lagos, and a B.Sc. from Edo State University. She enjoys documentaries and values quality time with family.</p>",
    "category": "board"
  },
  {
    "name": "Julius Obayemi",
    "description": "Group Chief Operating Officer",
    "image": "/images/team/julius-obayemi.jpg",
    "about": "<p>Julius Obayemi is the Chief Operating Officer of Fasyl Group, with over 27 years of IT experience and several award-winning projects to his credit. He holds degrees in Business Administration from Ladoke Akintola University of Technology and Computer Science from the University of Benin, as well as an MBA from China Europe International Business School.</p><p>Before joining Fasyl, Julius worked at the Federal Office of Statistics and the Central Bank of Nigeria. He later joined UBA Group, where he managed the database infrastructure and led a team of over 24 technical and functional support staff.</p><p>Since joining Fasyl in 2005, Julius has led multiple projects and implemented Flexcube Core Banking Applications in more than 15 banks. Notably, he directed the deployment of Ecobank's Flexcube CBA across over 30 countries from 2007 to 2011. His expertise includes Oracle Database Administration, Data Migration, Application Development, Business Process Re-engineering, and Project Management.</p>",
    "category": "executives"
  },
  {
    "name": "Maryam Kwakye",
    "description": "Country Manager, Fasyl Ghana",
    "image": "/images/team/placeholder.png",
    "about": "<p>Mariam is the Regional Director of the Fasyl Technology Group. She is a well-seasoned Information Technology sales expert with several years of experience in Business development and sales.</p><p>She also has managerial skills recruiting, training, coaching & supervising personnel and is a vital member of Training and Education Committee of LOAG.  She has successfully sold several IT solutions to top organizations over the years.</p><p>She is a Finance graduate from Ghana Institute of Management and Public Administration, with a Masters degree in Peace, Security and Conflict from Kofi Annan International Peacekeeping Training Center.</p><p>Her interests and focus are in providing value and solving the IT problems of organizations with our wide range of IT solutions.</p>",
    "category": "executives"
  },
  {
    "name": "Adejoke Odeyemi",
    "description": "Group Executive director of sales",
    "image": "/images/team/adejoke-adeyemi.jpg",
    "about": "<p>Adejoke, known as Joke, is the Group Executive Director of Sales at Fasyl Technology Group, overseeing technology solutions and growth planning. With over 20 years in sales and relationship management, she excels at turning conversations into opportunities. Joke launched her career in the early 2000s, providing tech solutions to major Nigerian banks like Polaris, Union, UBA, FBN, Access, and Wema Bank. Her expertise spans Africa, engaging financial organizations in Ghana, Sierra Leone, and Gambia. Joke prioritizes customer satisfaction, ensuring every interaction is intentional and fulfilling.</p><p>She holds a BSc in Public Relations and Advertisement and an MBS in Global Business from Atlantic International University, USA. Joke is a member of the Institute of Governance and Management and the Nigerian Institute of Public Relations. Well-traveled, married, and a mother, she balances professional expertise with personal fulfillment.</p>",
    "category": "executives"
  },
  {
    "name": "Uche Opara",
    "description": "Project Director",
    "image": "/images/team/uche-opara.jpg",
    "about": "<p>Meet Uchechukwu Opara, a visionary technology business consultant with over two decades in the tech industry. She holds a Computer Science degree from the Institute of Management & Technology, Enugu, and an MBA from Lagos State University.</p><p>As a leader, Uche has driven transformational projects in the banking sector, pioneering solutions for business growth in Africa. A trusted advisor on core banking applications and fintech solutions, she works with top financial institutions.</p><p>Uche is dedicated to developing young professionals through coaching, mentoring, and training. She is a certified speaker, coach, and trainer with the John Maxwell Team, a DISC Behavioral Analysis Trainer, and a fellow of the Institute of Management Consultants. She also holds a Certified Management Specialist certification from the London Graduate School and is a member of the Project Management Institute.</p><p>Her mission is to empower young professionals to achieve balanced success in their careers.</p>",
    "category": "executives"
  }
]
